app/views/sorts/new.html.erb

SELECT "products".* FROM "products" WHERE "products"."sort_id" = ?  [["sort_id", 1]]
---
                    <td>
                        <% sort.products.each do |product| %>