app/controllers/orders_controller.rb

    def create
        @order = Order.new(order_params)
        if @order.save
---
INSERT INTO "orders" ("name", "email", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

        def find_order
            @order = Order.find_by(id: params[:id])
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]