app/controllers/products_controller.rb

  def index
      @products = Product.all
      @sort = Sort.find(params[:sort_id])
      @product = Product.find_by(id: params[:id])
---
SELECT "products".* FROM "products"
SELECT  "sorts".* FROM "sorts" WHERE "sorts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]

  def new
      @sort = Sort.find(params[:sort_id])
---
SELECT  "sorts".* FROM "sorts" WHERE "sorts"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]

    def edit
        @product = Product.find_by(id: params[:id])
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def update
        @product = Product.find_by(id: params[:id])
        if @product.update(product_params)
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "products" SET "name" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["name", "Betamethasone 阿斯顿的"], ["updated_at", "2017-06-16 06:33:40.998461"], ["id", 1]]

   def create
        @sort = Sort.find(params[:sort_id])
        @product = Product.new(product_params)
        @product.sort = @sort

        if @product.save
---
SELECT  "sorts".* FROM "sorts" WHERE "sorts"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
INSERT INTO "products" ("name", "number", "sort_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "qwe"], ["number", "qwe"], ["sort_id", 1], ["created_at", "2017-06-15 02:10:01.440112"], ["updated_at", "2017-06-15 02:10:01.440112"]]

    def show
        @product = Product.find_by(id: params[:id])
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def destroy
        @product = Product.find_by(id: params[:id])
        @product.destroy if @product
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "products" WHERE "products"."id" = ?  [["id", 1]]