app/controllers/sorts_controller.rb

SELECT  "sorts".* FROM "sorts" WHERE "sorts"."sort_id" IS NULL LIMIT ?  [["LIMIT", 1]]
SELECT "products".* FROM "products" WHERE "products"."sort_id" IN (1, 2, 3, 5)
---
  def index
    @sorts = Sort.all
    @products = Product.search(params[:search])

SELECT  "sorts".* FROM "sorts" LIMIT ?  [["LIMIT", 1]]
---
  def new
    @sorts = Sort.all

INSERT INTO "sorts" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "阿斯顿"], ["created_at", "2017-06-14 07:51:10.240926"], ["updated_at", "2017-06-14 07:51:10.240926"]]
---
  def create
    @sort = Sort.new(sort_params)
    if @sort.save

SELECT  "sorts".* FROM "sorts" WHERE "sorts"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
DELETE FROM "sorts" WHERE "sorts"."id" = ?  [["id", 5]]
---
  def destroy
    @sort = Sort.find_by(id: params[:id])
    @sort.destroy if @sort