app/views/products/index.html.erb

        <ul class="product_list">
        <% @sort.products.each do |product| %>
---
SELECT "products".* FROM "products" WHERE "products"."sort_id" = ?  [["sort_id", 1]]